---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition
source: html/8ad48bcf-05f3-b9c3-ebfb-2a7b2db2fd83.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition

The ElectricalDemandFactorDef class represents a serialized version of an instance of
 demand factor definition. It has a name, rule type, and values for the rules that are serialized.

## Syntax (C#)
```csharp
public class ElectricalDemandFactorDefinition : Element
```